In [1]:
import pandas as pd

In [19]:
data = { 
'CustomerID': [201, 202, 203, 204, 205], 
'CustomerName': [' Anna_Bell ', 'michael smith', 'KAREN.JOHNSON', 'james o\'neal', '  lisa-kim '], 
'Email': ['ANNA123@MAIL.COM', 'm.smith@work.net', 'KARENJ@domain.com', 'jameso@now.com', 
'lisa_kim@mail.com'] 
} 
df = pd.DataFrame(data)
df

   CustomerID   CustomerName              Email
0         201     Anna_Bell    ANNA123@MAIL.COM
1         202  michael smith   m.smith@work.net
2         203  KAREN.JOHNSON  KARENJ@domain.com
3         204   james o'neal     jameso@now.com
4         205      lisa-kim   lisa_kim@mail.com

# 1. Strip leading and trailing spaces in the CustomerName column.

In [18]:
df['CustomerName'].str.strip()

0        Anna_Bell
1    michael smith
2    KAREN.JOHNSON
3     james o'neal
4         lisa-kim
Name: CustomerName, dtype: object

# 2. Convert all names in CustomerName to lowercase, then to title case.

In [1]:
df['CustomerName'].str.lower()

NameError: name 'df' is not defined

In [16]:
df['CustomerName'].str.lower().str.title()

0       Anna_Bell
1    Michael Smith
2    Karen.Johnson
3     James O'Neal
4        Lisa-Kim
Name: CustomerName, dtype: object

# 3. Replace underscores (_), hyphens (-), and dots (.) in CustomerName with a space.

In [34]:
df['CustomerName'].str.replace('_',' ').str.replace('-', ' ').str.replace('.',' ')

0       Anna Bell
1    michael smith
2    KAREN JOHNSON
3     james o'neal
4        lisa kim
Name: CustomerName, dtype: object

In [37]:
df['CustomerName']=df['CustomerName'].str.replace(r'[_\-\.]',' ',regex=True) # next process
df

   CustomerID   CustomerName              Email
0         201     Anna Bell    ANNA123@MAIL.COM
1         202  michael smith   m.smith@work.net
2         203  KAREN JOHNSON  KARENJ@domain.com
3         204   james o'neal     jameso@now.com
4         205      lisa kim   lisa_kim@mail.com

 # 4. Count how many names in CustomerName contain the word "smith" (case-insensitive).

In [39]:
df['CustomerName']

0       Anna Bell
1    michael smith
2    KAREN JOHNSON
3     james o'neal
4        lisa kim
Name: CustomerName, dtype: object

In [48]:
df['CustomerName'].str.count("smith")

0    0
1    1
2    0
3    0
4    0
Name: CustomerName, dtype: int64

# 5. Find and return all rows where Email ends with .com.

In [50]:
df[df['Email'].str.endswith(".com")]

   CustomerID   CustomerName              Email
2         203  KAREN JOHNSON  KARENJ@domain.com
3         204   james o'neal     jameso@now.com
4         205      lisa kim   lisa_kim@mail.com

# 6.   Create a new column called FirstName by extracting the first word from CustomerName.

In [52]:
df['CustomerName'].str.split().str.get(0)

0       Anna
1    michael
2      KAREN
3      james
4       lisa
Name: CustomerName, dtype: object

In [54]:
df['FirstName']=df['CustomerName'].str.split().str.get(0)
df

   CustomerID   CustomerName              Email FirstName
0         201     Anna Bell    ANNA123@MAIL.COM      Anna
1         202  michael smith   m.smith@work.net   michael
2         203  KAREN JOHNSON  KARENJ@domain.com     KAREN
3         204   james o'neal     jameso@now.com     james
4         205      lisa kim   lisa_kim@mail.com      lisa

# 7.  Create another column called LastName using the second word (after cleaning).

In [55]:
df['LastName']=df['CustomerName'].str.split().str.get(1)
df

   CustomerID   CustomerName              Email FirstName LastName
0         201     Anna Bell    ANNA123@MAIL.COM      Anna     Bell
1         202  michael smith   m.smith@work.net   michael    smith
2         203  KAREN JOHNSON  KARENJ@domain.com     KAREN  JOHNSON
3         204   james o'neal     jameso@now.com     james   o'neal
4         205      lisa kim   lisa_kim@mail.com      lisa      kim

# 8.  Extract just the domain (e.g., mail.com, work.net) from each Email address.

In [64]:
df['EmailDomain'] = df['Email'].str.split('@')
df

,CustomerID,CustomerName,Email,FirstName,LastName,EmailDomain
0,201,Anna Bell,ANNA123@MAIL.COM,Anna,Bell,"[ANNA123, MAIL.COM]"
1,202,michael smith,m.smith@work.net,michael,smith,"[m.smith, work.net]"
2,203,KAREN JOHNSON,KARENJ@domain.com,KAREN,JOHNSON,"[KARENJ, domain.com]"
3,204,james o'neal,jameso@now.com,james,o'neal,"[jameso, now.com]"
4,205,lisa kim,lisa_kim@mail.com,lisa,kim,"[lisa_kim, mail.com]"

In [66]:
df['EmailDomain'] = df['Email'].str.split('@').str[1]
df

   CustomerID   CustomerName              Email FirstName LastName EmailDomain
0         201     Anna Bell    ANNA123@MAIL.COM      Anna     Bell    MAIL.COM
1         202  michael smith   m.smith@work.net   michael    smith    work.net
2         203  KAREN JOHNSON  KARENJ@domain.com     KAREN  JOHNSON  domain.com
3         204   james o'neal     jameso@now.com     james   o'neal     now.com
4         205      lisa kim   lisa_kim@mail.com      lisa      kim    mail.com

# 9. Filter all customers whose email contains the word “mail” (case-insensitive).

In [74]:
df[df['Email'].str.contains('mail')]

   CustomerID CustomerName              Email FirstName LastName EmailDomain
4         205    lisa kim   lisa_kim@mail.com      lisa      kim    mail.com

In [75]:
df[df['Email'].str.contains('mail',case=False)]

   CustomerID CustomerName              Email FirstName LastName EmailDomain
0         201   Anna Bell    ANNA123@MAIL.COM      Anna     Bell    MAIL.COM
4         205    lisa kim   lisa_kim@mail.com      lisa      kim    mail.com

# 10.  Identify emails that contain any digits using a regex pattern.

In [77]:
df[df['Email'].str.contains(r'\d', regex=True)]

   CustomerID CustomerName             Email FirstName LastName EmailDomain
0         201   Anna Bell   ANNA123@MAIL.COM      Anna     Bell    MAIL.COM

# 11. Check if any customer names contain special characters like ', ., or _ before cleaning.

In [85]:
df[df['CustomerName'].str.contains(r"[\'._]", regex=True)]

   CustomerID  CustomerName           Email FirstName LastName EmailDomain
3         204  james o'neal  jameso@now.com     james   o'neal     now.com

# 12.  Create a column NameLength that stores the length of the cleaned CustomerName.

In [87]:
df['NameLength']=df['CustomerName'].str.len()
df

,CustomerID,CustomerName,Email,FirstName,LastName,EmailDomain,NameLength
0,201,Anna Bell,ANNA123@MAIL.COM,Anna,Bell,MAIL.COM,11
1,202,michael smith,m.smith@work.net,michael,smith,work.net,13
2,203,KAREN JOHNSON,KARENJ@domain.com,KAREN,JOHNSON,domain.com,13
3,204,james o'neal,jameso@now.com,james,o'neal,now.com,12
4,205,lisa kim,lisa_kim@mail.com,lisa,kim,mail.com,11

# 13.  Count how many customers have names longer than 10 characters.

In [101]:
df['CustomerName'].str.len().gt(10).sum()

np.int64(5)

# 14.  How many unique domains are in the Email column?

In [104]:
df['Email'].str.split('@').str[1].nunique()

5